#+TITLE: TODOs example

This is an example of an automatically updating org file.  When a user
modifies start or end times and commits a file an action detects the
change and runs org mode table update function which updates the hours
field and the total sum.

| Start time | End time | Activity           | Hours |
|------------+----------+--------------------+-------|
|         03 |       07 | App dev            |     4 |
|         09 |       12 | App dev            |     3 |
|         13 |       15 | Course             |     2 |
|         15 |       17 | Atlas fdsanuifnasd |     2 |
|         10 |       18 | Daily              |     8 |
|         11 |       12 | Daily activities   |     1 |
|------------+----------+--------------------+-------|
|      Total |          |                    |    20 |
#+TBLFM: @>$4=vsum(@2$4..@>>$4)::$4=($2 - $1)

In Emacs this can be done manually by placing a point on the =TBLFM=
instruction and using =C-c C-c= or, just like the action does it,
running =org-table-iterate-buffer-tables=.

A couple of ToDos:

* Project
** Task 1
:LOGBOOK:
CLOCK: [2024-07-30 wto 05:54]--[2024-07-30 wto 09:24] =>  1:30
:END:
** Task 2

And a report:

#+BEGIN: clocktable :scope file :maxlevel 3 :link t
#+CAPTION: Clock summary at [2024-08-08 Thu 12:58]
| Headline     | Time   |      |
|--------------+--------+------|
| *Total time* | *3:30* |      |
|--------------+--------+------|
| [[file:/home/wiktor/src/meta/org-test/README.org::*Project][Project]]      | 3:30   |      |
| \_  [[file:/home/wiktor/src/meta/org-test/README.org::*Task 1][Task 1]]   |        | 3:30 |
#+END:
